microDev1/circuitpython/ports/esp32s2/boards/GENERIC/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ESP32S2 Module"
#define MICROPY_HW_MCU_NAME "ESP32S2"
